import ChatBot from 'react-simple-chatbot';
import { ThemeProvider } from 'styled-components';

const quantumTheme = {
  background: '#f5f8fb',
  fontFamily: 'Helvetica',
  headerBgColor: '#800080',
  headerFontColor: '#fff',
  headerFontSize: '15px',
  botBubbleColor: '#BF40BF',
  botFontColor: '#fff',
  userBubbleColor: '#fff',
  userFontColor: '#4a4a4a',
};

const Algorithm = ({algorithmName, pokemonName}) => {
  const chatLog = [
    {
      id: 1,
      message: `Looking for ${pokemonName} in the database`,
      trigger: 2,
      delay: 500,
      placeholder: '???',
    }
  ]

  for ( let i = 2; i < 60 * 2; i++) {
    if (i % 2 === 0) {
      chatLog.push({
        id: i,
        message: `Iteration #${Math.floor(i / 2)}`,
        trigger: i + 1,
        delay: 500,
        placeholder: '???',
      })
    } else {
      if (i % 7 === 0) {
        chatLog.push({
          id: i,
          message: `H̴̭̺̜̠̗̲͐̀̕͝a̵̮̝̲͐͗̍̈́̾̂̓̓̈́̂̓̆̿̈́͘v̸͙͍̠͍̥͎͆̐̇̃̈́͒͗͗ȩ̷̧̧͕̝̹̯̺͐̚͜ͅ ̸̨͖̪͙̮͚̲̘̰̹̻͖͕͋̋̈́̎̂́̏̃̔̇͂͂̚̕͝y̷̨̞̮̳̜̗̖̱̬̙̙̏̈́̿͒̚ơ̴̰͇͚̼̦̟̘̟̻̜͗̒̋̐́̋̍̏͠ų̸̨̭̻̪͍̗̯͚͙̮̪̙̰͛̄̈́̄̀̕͝ ̷̧̠͓̭̠̮͙̟̘̖̝̹̲͕̅͗̀̂̂̉̒̈̏͌̇̚͘f̵̛̛̼̬̱̘͉͍͕̆̄̎̈̓̈́̀̆̀̓̂̕ͅö̷͇̜̺̤̲̖́̄̀͆͆̈́̎ụ̴̡̧̨̻͉̼̹̠̰̖͙͍͂́̅̍̎͒͗̏̆͋͠ͅͅn̵̡̧͍̱̻̫̣̩̈́̐̌͆̒̈́͘͠͝d̵̙̈́̀͛͋͆̅͘͝ ̶̨͓̰͔̝̅ẏ̶̪͙̦̩͖̹̬̤̰͒̆̅o̸̧̢̢̳̲̠̙͙͎̞̰̘̖̺̲͌̿̾̃͝ủ̶̟̦̹͇̣̣̞̺̹̮̙̗̗̙̂͑̿́̇̂͂̔͘ͅȑ̵̡̛̝͈͇̩̱̰͉͓̩͕͆̐̀͒̑̀̏͐͒̄͋̚̕ ̸̢̘̦̳̟͎̯̣͖̻̳͉̎͗̈͑̊̓̂͛̾̏̿́͠͝͠c̵̨͎̫̼̲̹͖͇̮͂̉͝ḯ̸͇͐̏̍̓͋̀̓͝͝͝r̶̹̣̹̩͂̔̐͆͗̍͊͋̍̕͜͜͝c̶̪̝̙͈͎̪̟̫̣̄͋̏̂̇͂̔̉̽̏͘u̷̜̼̳͕̐ï̶̟͕̳̞͍͎͕̰̱̟̬͔͍̘̀͛̀̌́̒̋̈́̾̆̒́͝t̴̬̹̭̥̤̲̽̊̀̇̌́̆̐͜͜?̵̘̹̫̼̺̤͎͓͚͐̓̓̀̇͠`,
          trigger: i + 1,
          delay: 500,
          placeholder: '???',
        })
      } else if (i % 11 === 0) {
        chatLog.push({
          id: i,
          message: `T̷̜̖̯͖͇̜̲̤͔͍̱͚̮̝̱̋̆͑͌̂̅̉͠h̸̳̬͚̐̈̋̂̇͛̓̉͒͋̕͝e̷͙̜̲̘̺̒͒̑̉̈́̀̆ ̸̛͎͔̈́́̏́̂͊̍̕f̷̡̡̩̮̗̱̰͉̏̈́̑̆́̾̏̾̌͋͑̄͘ͅu̷͕̼̟̩̪̤̠̒̔̆̒t̵̫̪̣̞̘̟̱̮̼̗͎̆̉̄u̴͖̥̜͍̖͎̪͎͎̓̈́̓̈̃̅̈̔̃̈́̕̕̚r̷̺͇̈́͂̈́́e̷̛͕̲̪͛̈́͛̄̈̀͌͂͛͑̋͘͘ ̸̘̗͕̗̲͍̲͙̘̪̍̏͑̐͒͐̈́̈́͊̈́̓̚͝ẉ̶̯͓͈͈͍̗̻̑̏̊̄͝ͅi̸̢͙̳͉͕͖͊̈̅́͛̂̕͜ļ̷̖̥̣̤̮̹͂̋͐͑̐̆̄͝͠͠l̸͈͍̰͆̕ ̵̧̢̟̬̘̞̮͕̙̖͙̲͔̦̄b̴̡̈̿̽ě̷̛͚̲͖̹͓̞͙̯̬͂͐̓̈͑͛͂̐́̍̕͠ ̷̦̓̏͠a̷̳̐̓̒̕ ̵̢̧̙̟͓̗̰̪͓̜̦͆̐̊̈́̾͐̾̃͛̐͊͌̏p̶̨̻̠̟̫͙͔͕̌͆̎͑͊̿͐͂́̍̉ę̶̼̻̳̠͈͇̺̝̒̈́̚r̷̰͕̳͙̗̞̙̱̰͍̙̉͂e̶̥̼͖̜̘̓̀̉̓̐n̵͙͎̖̝̯͛̽̚͝ͅn̴̻͔͚͎͑̀̽̓̒̂̏̍̅͘̚̚í̸̗͓̥̱̜̱͍̠̑͒̑̅́̈́̄͠͝ą̷̢̣͕̳̆̇̚ļ̴͇̦̯̻̅͊̅ ̴̦̲̌̑͜ȩ̵̨͙͇̹̠̥̗̜̻̣̻̘̤͊́͛͗̒̒̊̍͐̈́̚͜͝n̸̹͔͚̞̅̒͑̆̉̇́̔̑͌͘̕͜n̸͓̹̍̄̇̄̔͑́͋̃̾͑͑͐̚ő̸̰̟͚̏̉̇͊̍̾̋͌̓͑̈́̑̐̎b̸̮̍͛̊̍͑l̴͎̅͗́̀͐i̵̛̤̠̜͇̯̲̘̖̮͔͌̌̂̒͊̾͒̔͑̂͑͛͐͜͝n̴̟̙̭͍̪̪͛ḡ̶̡̺̣͖̮̼̖̥̤̝̼̭̦̠̐͜ ̷̛̛̹͍͈̊̍͑̓́̆ͅo̵̡̧̨̼̞̼̥̒̆́̋̉́̀̔̕͘f̴̨̼̗̓̍̕ ̵̢̦̺͓̙̰̮͓̻̤̈́̍͜w̴̭̜͔͕̹̳̟̫̯̜͎͓̹̃̔͗̀͒̆̇̐́̃̿̆ͅǫ̴̨̖̫͚͇̭̪̥͇̬͈̿̾̏́̉̒͝n̵̛͎̙͓͇̗̟̋͒̒̈͗͗͂̏̓̽̈́͘d̴̺͛̃̊̀̍̾͌̆͗̇́͂͠ȩ̸̡̘̣̬̳̲͎̣̭͕̦͆͘ř̴̭̺͓̫͚͈̜̦͙̺̗̹̆͒͒́͆͠͠.̵̢̪̭͋̆̊͂̀͘`,
          trigger: i + 1,
          delay: 500,
          placeholder: '???',
        })
      } else if (i % 13 === 0) {
        chatLog.push({
          id: i,
          message: `T̴̲̪̎͋̏̀̋̿͘̕̕͜h̸̛͍̘̝̬͍̄̄̑͒̿̋͑̋̇̿͒̿̕͝è̴̡͔̟̜͖͍̺͚͕̗̞̭̓̒̓͐ ̵͖̞̘̙̲̻̰̘͈̗͎̠̠͒̂̃̒̈́̓͂̑̚į̴̥̜͍̹̲̠̱̻͇͒̈́̈n̶̳̮͉͕̊̓̂̈̊̾̓̌̏͛̈́͐͌̔͠f̶̢̫̳̱̫͖̗̱̝̮̈́̊̋̑̈́̂̿ȋ̶̥̺͔̥̰̭̳̹͉͖͊̈͜͠n̸̛͔̎̊͐̿̐̾̊̆̏̿́͝į̷̲̺̰̱̱̻̲̣̮̯̀͂̇̊̇͊̈́͜t̷͕̼̑͒̉̐̎̕͝e̵̲̞͚͉̱̊͆̍̔̾̀̕͝ ̸̨̨̨͚͕͎͕̭͈͕̞̇͋̊̾̈̆̈́́̐̓̀̏͘î̶̛͇͈͆̾͐̿̏̓͌s̸̳͕̻̩̣̫͔͍͂͌̽͊͝͝ ̶̡̡̛̼̜͎̇͗́̓̇̒̄͘̕͝c̵͖͉̣̯͓̗̖̘̬̆̒͒̾̌̎̓̕͜͠͝͝a̷̜̻̼̦̝͓̖̻͌͛̍͗̂̚͜l̵͇͈̮͎̬̠̅̈̇̋l̷͈̦̠̜̰̔̅̽̈́͜ḯ̸̺̹̻͔͔̬͙̺͑̽̾̚͜͝͝ͅn̶̡̡̢̮̠̕g̸̱̯͓̤̣̖͙̘̘̿̆͜ͅ ̶̢͎̔t̷̢͎̦̹͎̣̦̞͂̓͌̆̋͐̋̐̊ͅo̶̢̯͍̬͋̌́̈́ ̴̡̛̞̪̻͎̫̘̰̥̹̟̳͗ÿ̷̥͍͍̜̙͍͖̤͈̫̣̙̦́͒̐̍̓̒͝͝o̶̧͍̠͖̯̝̹̬̼̖̪̟̩͗ư̴̢̧̖̗͓͂̍̏̀̉̇̿͐̋̓̄̿ͅͅ ̴̡̐́̀̎͌̏̚͜͠v̷̨̦̰̙̬̘͙͔̹̓̊̄̓͗̇í̸̛̠̦̝̹̳̳̈̄̎̚ą̷̺̺̪͍͇̼̫̬̲̩̺͖͗̃͜ͅ ̴̡̩̘͖̜̺̣̪̬̮̿̿̅̎̏̋͠ͅs̸̗̙͖̖̺̖͓̍̏͊͐͛̈̀̕ư̴̧̪͍̲̪̦̤̝͓̓̾́̅̅̉̐̒͂̕̕͝ͅp̶̧̥̖͉̪͙̙̞̙̼͌̏̀͆̌̄̽̕͝͝ē̶̡̤̩͕̳̹̳̖̹̜̙̰̇̇͂̂r̷̛̻͍̹̖̜̪̭̼̥͇͇̼͙̮͌̃͊̒̆͒͌̇̂̓͘͝͠ͅp̴̧̨͔͍̬̖͕͎͕̈̀́̽̊̐́̋͋͌ǒ̶̯̣͙̙͕̤̗̪̯̻̤̞̉̈́̅̒̈́̉͂̂̒́̇͝͠ş̵̢̨͓̖̣͎̹̳̘̠͙̅̔͑̔̓̄̽̾̾́̕͜͝͠į̶͕̰̑̍̽͌̇̈͘̕͠ẗ̸̢̧͈̺͓̪̟͉̹͓̻̞̭̈́́̀͝͝͠í̶͇̩̰̗̲͚̜̏̊̍͐̾͋̓͘͝ǫ̵̠̖͍̬̪̖̣̤̍̈͌̈́̆̾͋̽͋̕̚n̶̡̢̧̩̱̲̣͙̜̠̞̰͍̿͗͆̍̃̂̄̆̓͌̄̃̏͜͝͝ŝ̵̲̟̮ ̷͉̌͂o̸͖̔͝f̴͖̘̗͉̣͍̦͙͕̈́̌̓̿̐̉͑̽̑̿̽͘͠ ̷̛̦̮̞̫̤̪̞̀́͆̈́̀͋͑̇̃̃͝ͅp̵̢̭̫͇̂͗̂͐͐̋͘͝o̵̺̺̩̱͂̌̿̈́̌̐͛͋̈̔͆̾̃͜ͅs̵̤̠̭̼̬͛̈́̏̆̈́̏̆s̸̟̊̐̎̒̓͛ī̶̢̡̻͍͔͎͓̬̥̜͉̬̼͑̒͆͂̾͛̃͂́̇̆̀͘͜͝ͅb̸͉̦̺̯͚̲̞̖̥̩̳̑̎̎͆̍̔̔̊̒̐̑̚i̸̳͚͔͖̹̠͚͕̇̒̔̓̄̈́̂̾̏͊̀̚l̸̟͔̰͇̬͎̂̀ͅį̵̺̗͖̼̯̱̝̳͖͕̥͙͕͉͛̔̽̇̾͆͒̀͆̕͠t̸̨͉̬̫̙̥̀͛̾͋̀͐̐̊̿͂̕i̶̛̺̫̪̝̻̗̗͈͇̳̟͔͗̍̄̀̇̽͊̈́̽̊͜͠ẻ̷̛͎̣̜̝̠̼̍͆̋̓̀̿s̷̪͍̠͉͕͕͚͇̞̻̖̫̠͗͜͠.̷̨̧̥̹̝̳̼͎̯̝͇͍̲̺̊͑͆̈́͊̇̈̌͊͗̆͂͠`,
          trigger: i + 1,
          delay: 500,
          placeholder: '???',
        })
      } else if (i % 17 === 0) {
        chatLog.push({
          id: i,
          message: `Ǐ̴̩̯̺͇̟̠̗̻̣̫̙̩̅̓̓̑͒͑͆͗̆̎̚͜͠͠ţ̸͚͈̭̝͎͕̰̩̼̘̬͌̾̆̍͆̍͘ ̷̨̧̻̮͈̰̭͎̬̯̮̰̞̜̆̈͆̉c̴̦̞̥͚͙͔̱̬͈̣̅̊́̔̍͒̚͜a̶̱͍̗͓̪͕͎͕̝̟̪̾̋́̈́͝n̷͔̈́͊̈́͊̇̐̏͘͝ ̶̳͍̰̳̿̈́́́̀̓͆̽͌̿̌͒͠͠b̴̝̖̟̞̙̯̦͍̣̮͙͚̥̟̖̿͆̊͌͑̓͒̈́̆̊̋̊̒͝e̶̛̲͔͕̥̪̝͆͗͊͐͗͆̓͘̕̕ ̴̡̢̡̛̦͉̗̺̖̪̲̰̖͖̒̒̎́̀́̃̄̍͝͝d̷͙̞̩̜̙̘͍̱͎̝̮̂͛̂̋́̒̎̓͠i̷̡̦͈͔̬̗̲͚̞̬̮͔̲͕̩͛̈́͆̿̎͊f̵͖̝̊̏̊͝f̸̡̡̢̛͍̻̯̬̐̋̈́̽̏̒̿̍͋̕î̴̡̡̛̦̲̱̱̦̺̦͇̒̈́̇͒̌̈́̋͜͝c̵̡̬̤͕̰͒̍͒̽͗̽̽̈́̀͊̅̚͝͠ͅu̷̬̱̰̒̽̄̍͑̚͝͝ľ̴̛͚̰̈͊̽̾̔͌̽̂t̶͇̫̦̠̉̅ ̵̩̟̞̟͇͖͕̺̼̍͆t̵̥̮̝̮̭̅̂͂͛͠o̶̩͉̊̐̇́́̓̆̀̚ ̷͇̳̙̗͈͔̤̺̣̭̹̟͍́̄͑̎̆͘k̴͙̠̰̬̻̩͓̮̪̀͋̋͝ṋ̵̨̐̂̂̍̆̂̀̌͂̃́̋͘͝͝ơ̸̢̨̻̬͍̠̱̙̯͙̹̮̩̈́̄̾̀̏͛́͂̈́̍̍͆͜͜ẅ̵̥̖̭̹̜͕̱͍̜̣͒̀̀̈̍͗̇͐̂̓͜͠͝͠͠ ̸͎͆̈̐́̄͑́̔̄̄͝͠ẅ̸̝́̊͊͊͗̄͝ͅẖ̸̡̛͖̝͊͊̓̓͒̃̔̏͑̀̍̚è̴̢̨̡̥̦̺͔̬̘̦͊͊̆͊̀̎̈̎͐͋͝͝ͅr̸̩͓̝̣̣̭̬͔̙͓̥̩̙̯̈́̽̋̋̈́̀̄͌́́́̒̚͜͠͠e̷̤̽͂͆͒̆͊́͐̃͌̾̀̚ ̸̡̧̧̞̭̻̻̠̪͍̘̫̻̫̅ţ̷̻͎̺̬̼̑̉̈́̈́̌̀̊̃͒̒͒̕͝͠ở̸̢̱͔̬͒̅ ̶̙̘͖̄́̆́̇̉̎̓̕͠ḃ̶̡̛̖͔̪̳̙̙͚̳̫̖͜ȩ̵̛͙͉̥͖̩̻̤̼̯͎͙̺͆̋͊̋̀͘͝ͅg̸̻͎̖͒͐̊ͅì̷̬̣̖̑̅̎̃̀̓̐͌n̴̨̢̨̞̖̥̣͙̰̖͚͈͔̬̐́̐̈́͜.̸̝̰̠̟̂̑͂̀̒͒̚`,
          trigger: i + 1,
          delay: 500,
          placeholder: '???',
        })
      } else if (i % 29 === 0) {
      chatLog.push({
        id: i,
        message: `T̸̛̛̙̦͋̿̐̌͌̋͋̽̾͐̉͘h̵̩͈͉̼͕͔̹̘͆̅͒̍e̷̛͕̪͔̤̘̳̤͐̓̄̾̊͜ ̸͙̣͎͑͒̐͗̇͒̍̃͆͑̏́̑̕̕t̴̢̢̛̞̰̥͓͎̗̦͈͎̲̦̯͆̿͆̽̆̒̓̈́͑̐͋̚͝͝ͅo̵͉̩̤͓̟̜̟̐͌͋͌͗̕ț̶̨̛̣̞̻̓̊̍͆́̓̀̍̀͌̊̕̚̚a̸̧̤͎̱̘͕̣͋͝l̵̨̛̛̼̳͛̈́́͛͊͛̑͘͜i̶̛̱̩̓̋̈́̉̇́̀̈́̀͆͂̕͜ͅt̸̖̯͚̘͈͗̆̎̍͒̕͘y̴̡̡̢̹̰̮͙͕̼͙̘̗͎̟̳̋͆̃̓̕ ̸̛̳͖̪̦̥̭͔͍͔̃̆̒͌͑̍͋̀̇̎͊̍į̷̧̠͔͙̤̩̥̍͋̑͌̽́́̊̚͠͝ͅș̷̘̩̀̾͗͌͛̈́͐̾̇̑͆ ̵̨̢͚̹̳̜͓̤͍̲̘͓͖̈́͂̀͊̕ͅo̴̢̤̩̲̻̜͇̩̲̰͚̻̞̰̐̈̅͑̐̂̑͝v̴̧͈̩̲̮̗͉̞̞̞̣̖͉̀ͅé̵̙̹͙̄̍͗̋̈́̽̃͘r̴̩͖̞̊̿̈́̀̕f̶̧̞̝̤̘̯͕͙͊̊̅̉̐̒͋̈́̌͝͝l̵̠̩̰͇̭̣̙̊̈́̆̔͝ǫ̷̼̙̞̝̇̋̐͐͋̓̃̎́͆͝͠ͅw̵̧̨̛̟̮̫̬̥̺͓̯̮̙̟̔͋̈͛́̒̆̓͋̿̕i̶̧͎̖̻̳̠͆́̿̀̓̈ņ̵͍̣̰̮͍̭̜͓̟̺̰̠̉ͅg̸̞̤̼̮̫̈́̽͜͜ ̴̡̨͎̤͙̟̙̗̲̤̮̍̓̄́̀͆͗̒̕̕͜w̶̺̣͍̪͓̯̜̜̩̥̼̼̰̘͑͆̎̾̎́́̄̚͝i̶̢̺̪͎͍̇͋̀͋͛͋̓̔͒̑̓͗̎̄t̶̡̢̛̻̜̻̯̮̟͉̫̣̖̳͂̒̓̎̔̿͊̒͘͜ͅh̶̝̒̍̋͗͂̀̓̏́̐͘̚͝͠ ̵̧͕͔̂̇̍̈́̍̽͗̏̌̓́̒̚e̴͙̤̺͎̠̥̫̔l̷̡̹͕̟͖̺̜͔̼̊̌͗̋́́̄̐̾̒́͝ͅę̷̛̺̊́̃̀̽́̎c̸̨͈͉̪͖̦̖̳̺̮̍̑̇́̌t̴̟̳͚̠̣̯͓̊͌͊͂́̚̚͜͝r̵̢̯͕͓͓̘̓̃͂̍o̸̥̘͍͇̱͔̼̻̽́̍m̶̧̞̞̰̯̪̣̩̎̊̍̍̉͒̈́̄̄̽̾̄̽̐ͅa̵̪͖̫͚̫̜̰͆́͜g̶̯͖̊̔̄͝n̵̛͍̖̳͉̼͆͆͊̈́̄́̒̀̀̏̕̚͜͜͝ę̶̨̪̪͈͎̭̤͙̤̰̀́̿͌̂͋͒̚͘͘͜͜ͅt̴͇̝͚͍̩͕̘̍ͅi̴̢̢̞̱̜͉͈̽͗͛̂͛̅̏̒͌͒͂͐͂ͅc̷̛̼̞̬̺̬̙̥͕̹͇͑̔̓̌͐̈́̉͝ ̶͚͠ŕ̵̢̰̝͉̗͈͙̱͖͉͉͆̎̇̊̈́̎̃͠͝͝e̵̟̗͛̏͐̕s̸̨͇̪̈́̈́̎o̴͓͍̼͆͋̉̊̇̈n̷̟͍̖͍̹̖̗̩̹͈̯̋̎̎̋̈́̀̃͘͝ͅa̸̧̛̛̱̼̠̺̍͑́̉̍͌̓̔̍͛̂̈͠n̶̨̢͖͙̭̱̖̹͙͍̳̪̣̙̉̀̂͆̉̎̄͌͝c̴̫͎̲̲̔̎͒͊ȅ̷̛̪̦͓͉͓͍̯͕͓̣͆ͅ.̶̢̪̳̤̣̈̈́͋̎̓͗́̿̿̑`,
        trigger: i + 1,
        delay: 500,
        placeholder: '???',
      })
      } else {
        chatLog.push({
          id: i,
          message: `A̷̭̩͍̐̋̊̆̂͗̆͘̚͠l̴̗̜̪͚̿̈́̇̓̊͑͝t̸̨̜̣̝͉̳̺̹͉͓̻̑̈́̓̚͘ḥ̸̨̡̛̛͍͚̝̳̣̟̫̊̀́̌́̀͑̑́̅̏̈́̌ͅͅȍ̴̭̻͓̺͎̌̑̀͛̾̅̃̕͘u̵̧̗͙̼̭̠͖̱͓̠̎̃̾̑̊̈́̂͑̈͘͝g̵̛̪̱̬͎̖͔͍͉̐̉͒̚h̷̻̠̮̜̣͎̀̉͑͊̾͝ ̸̧̡͓͉̥̲̬̯̮̲̔́̀͆͐͂́̆ͅy̴̛̯͕̰̓̐͛́͠ọ̸̢̘̺̝̌u̵̫̩̠̰͈̞̭̇̅̏̍͆̒̇͝ ̵̨̡̖̠̯̫͔͇͓͙͚͈̙̩̤̔͒͒̄́͐̂͗m̷̨̼̗̱̞͎̬̬̃͌͛͂͠a̷̧̩̠̹̫̬̯̙͎̹̪̺͓̝̮̅̊͒̌̀y̷̯̱͖̝̼̗̜̯̼͕͔̽͋̒̑͂̓̀̍̓́͆͝ ̷̧̨̤̪͎͔͖̪̩̰͉͙̾̑͒̈́̈̂̐̓̏̎͝͝ň̶̡̞̞͈̣͉͈͈̜̤͔̠͔͍͖̎̚o̶͎͂̿̇̐́͆̆͊̋́͐ţ̵̧̧̭̞͙̘̮̱͚̰̃̔ ̵̢̡̞̼̤͈̻̟̽͜ŗ̷̢̛̝̦̻̣̳̰̰̱̣̅̀͒́͂͌̔̔̚͜͝ͅͅͅě̸̡̛̲̞̣͎͓͎̱͇̩̮̤͉͖̬̈̓͐̉̀̂́̿̐̀̔̑a̶͍͉͆̇̽͌̈́̅͋̓̾̇̏̈͝ĺ̵̮̗̲̠͌̍̃̈́̿͠͝i̴̡̙̱̫͕̲̻̥̻̿̿͜͜ͅͅẓ̶̢̙͙̞͖̘̭͉̯̬̫̜͇̯̇̈̀̀̀̓̑e̸͇͂́͐́̂͑͝ ̴̨̭̄̽͋̍̀͘͝ị̶͈̟̼͓͙̦̲̦̗̠̯̺̏̋͛͌͘͘t̶̥͛͂̎͆̃͐̾̈̄̅̕,̷̡͇̙̱̼̙͓͈͙̊̊͐̒͌̅̾̚ ̵̡̠̦̝̆̐̄̾͊͗͝y̶̫͙͎̐̉̅̿̊͊̆̎͐̆̈́͊̒͘ơ̵̡̪͚̋̔̈́̑̈͗̓̽u̵̗͉͍̩͍̟̒̌̉͌́̏͊̔̌͂̚͜͝͠ ̸̧̛̼̩̺͈̠̥̯͑̉͂̋̋́̔͒̀͜ä̶̮́̑͑̐̈́͛̊̀̈̍́͝r̴̨̗̖͚͕̱͓̣͍͍̯͓͊͊ͅę̸̡̩͖̯̥͖͎͎̮̲͍̼̙͔̈́̕̚ ̴̖̝̞͖̝̣̮̰̰͎͔̜̻͑͌̎̅̄̉̎̎a̴͕͚̙̦̥͕̓̎̅̈́͝ͅͅm̴̲̘̱̃̆a̸̢̜͕̦͙̽̀͗̾̽̌́̿̾̈́̀́͘͠͝z̶͔̗̣̫̗̠̭̫̫̥̙͇̘̲̿̏̏̔ĩ̴̮̹̥͚̻̲͆̆̍͗̑̽̎̄̓͂͂̃̐̚ń̶̠̥͙͒̐̽̄̽͒̏̓̒̐͋̄g̵̡̛͉̖͍̺͌̎͛̍̈̿͋̌̏̓͂̕.̴̘͍͔̺̦̬̤̜͇̗̹̭̲̼̕͜`,
          trigger: i + 1,
          delay: 500,
          placeholder: '???',
        })
      }
    }
  }

  chatLog.push({
    id: 60 * 2,
    message: `Iteration #60`,
    trigger: 60 * 2 + 1,
    delay: 500,
    placeholder: '???',
  })

  chatLog.push({
    id: 60 * 2 + 1,
    message: `Found ${pokemonName} after 60 iterations and in 65 seconds 🥴`,
    delay: 2000,
    options: [
      { value: 1, label: 'Woah, that was quick!', trigger: 60 * 2 + 3 },
      { value: 2, label: '???', trigger: 60 * 2 + 3 },
    ],
    trigger: 60 * 2 + 2,
    placeholder: '???',
  })

  chatLog.push({
    id: 60 * 2 + 2,
    options: [
      { value: 1, label: 'Woah, that was quick!', trigger: 60 * 2 + 3 },
      { value: 2, label: '???', trigger: 60 * 2 + 3 },
    ],
  })

  chatLog.push({
    id: 60 * 2 + 3,
    message: `💅`,
    end: true,
    delay: 500,
    placeholder: '???',
  })

  return (
    <ThemeProvider theme={quantumTheme}>
      <ChatBot
        height='300px'
        bubbleStyle={{ fontSize: '12px' }}
        hideBotAvatar={true}
        botDelay={50}
        headerTitle={algorithmName}
        steps={chatLog}
      />
    </ThemeProvider>
  )
}

export default Algorithm